Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЖурналХолодногоЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЖурналХолодногоЗапуска</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СтатусыПодтвержденияСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СтатусыПодтвержденияСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОповещенияПоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОповещенияПоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_НастройкиОператоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_НастройкиОператоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОператоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьНовыеЧаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПростойОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПлановыеОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПлановыеОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмПередОповещением</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПакетыОповещенийПоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_АлгоритмыВРасписании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_АлгоритмыВРасписании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АлгоритмПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЗаписиКОповещению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЗаписиКОповещению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЗаявкиКОповещениюПоПредоплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЗаявкиКОповещениюПоПредоплате</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыПодтвержденияЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПеренос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенесено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтвечает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененоАвтоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ВидыПредопределенныхШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ВидыПредопределенныхШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьСПодробностями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьБезПодробностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтменеБезОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическоеСообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_РегламентныеЗадания/Ext/Module.bsl
Функция ПолучитьДатыХолодногоЗапуска()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЖурналХолодногоЗапускаСрезПоследних.Период КАК ДатаОкончания,
	               |	iga_ЖурналХолодногоЗапускаСрезПоследних.ДатаНачала КАК ДатаНачала
	               |ИЗ
	               |	РегистрСведений.iga_ЖурналХолодногоЗапуска.СрезПоследних КАК iga_ЖурналХолодногоЗапускаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ДатаНачала, ДатаОкончания", Выборка.ДатаНачала, Выборка.ДатаОкончания);
	КонецЕсли;
	
	Возврат Новый Структура("ДатаНачала, ДатаОкончания", Дата(1,1,1), Дата(1,1,1));
	
КонецФункции

Функция СоответствиеХешаПройдено()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХешБазы = iga_ОбщегоНазначенияСервер.ПолучитьТекущийХэшБазы();
	
	ХешКонтстанты = Константы.iga_ХешБазыДляПроверки.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);                     
	
	Возврат ХешБазы = ХешКонтстанты;
	
КонецФункции

Процедура iga_GreenAPIПроверкаИЗапускБота() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВремяОбработчика = Константы.iga_ВремяЖизниОбработчика.Получить() + 60;
	ВремяОбработчика = Макс(ВремяОбработчика, 3600);
	
	ДатаЗавершения = ТекущаяДата() + ВремяОбработчика;
	
	ОбработкаЧатБота = Обработки.iga_ChatBot.Создать();
	
	ОбработкаЧатБота.ИнициализацияОсновныхПараметров();
	ОбработкаЧатБота.ВремяРаботыОператоров = Новый Структура("Начало, Конец", 
		Константы.iga_ВремяНачалаРабочегоДня.Получить(), Константы.iga_ВремяОкончанияРабочегоДня.Получить());
	
	ДатыХолодногоЗапуска = ПолучитьДатыХолодногоЗапуска();
	
	ОбработкаЧатБота.ДатаНачалаХолодногоЗапуска = ДатыХолодногоЗапуска.ДатаНачала;
	ОбработкаЧатБота.ДатаОкончанияХолодногоЗапуска = ДатыХолодногоЗапуска.ДатаОкончания;
	ОбработкаЧатБота.ДатаНачалаОбработкиСообщений = Константы.iga_ДатаИВремяНачалаОбработкиСообщений.Получить();
	ОбработкаЧатБота.СтартовыйСценарий = Константы.iga_СтартовыйЭтапБота.Получить();
	
	//Пока ТекущаяДата() <= ДатаЗавершения Цикл
		
		ВыполнитьЧтениеСообщений = Константы.iga_ЧатБотИспользуется.Получить();
		
		Если Не ВыполнитьЧтениеСообщений Тогда
			//Прервать;
		КонецЕсли;
		
		ОбработкаЧатБота.ПолучитьИОбработатьСообщенияИзОчереди();
		
		//Задержка = Константы.iga_ЗадержкаМеждуЧтениемСообщений.Получить();
		//Задержка = ?(Задержка = 0, 3, Задержка);
		
		//ПаузаИсполнения(Задержка);
		
	//КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПаузаИсполнения(Секунд) Экспорт 
    
    WshShell = Новый COMОбъект("WScript.Shell");
    WshShell.Run("timeout /T " + XMLСтрока(Цел(Секунд)), 0, Истина);    
    
КонецПроцедуры

Процедура iga_ОчередьРаспределения() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	iga_РаспределениеСервер.ВыполнитьРегламентноеРаспределение();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура iga_ОбработкаПрикрепленныхФайлов() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	iga_РаспределениеСервер.ПеренестиФайлыВХранилище();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура iga_ОчисткаПараметровЧатов() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОтменитьЗаписьПоЗаявке(Заявка, Работа, ДатаЗаписи)
	
	Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
	Запись.Заявка = Заявка;
	Запись.Работа = Работа;
	Запись.ДатаЗаписи = ДатаЗаписи;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Статус = Перечисления.iga_СтатусыПодтвержденияЗаявок.ОтмененоАвтоматически;
		Запись.Записать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |ГДЕ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка = &Заявка
	               |	И iga_СтатусыПодтвержденияСтрокЗаявок.Статус В(&Статусы)";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Статусы.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	НетПодтвержденных = Запрос.Выполнить().Пустой();
	
	Если НетПодтвержденных Тогда
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		ЗаявкаОбъект.Состояние = Перечисления.ВидыСостоянийЗаявок.Отменена;
		ЗаявкаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура iga_ОбработкаОповещенийВЧатах() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	iga_ОповещенияПоВремени.Заявка КАК Заявка,
	               |	iga_ОповещенияПоВремени.ДатаОповещения КАК ДатаОповещения,
	               |	iga_ОповещенияПоВремени.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
	               |	iga_ОповещенияПоВремени.ДатаЗаписи КАК ДатаЗаписи,
	               |	iga_ОповещенияПоВремени.Чат КАК Чат,
	               |	iga_ОповещенияПоВремени.Чат.Идентификатор КАК ЧатИдентификатор,
	               |	iga_ОповещенияПоВремени.ШаблонОповещения КАК ШаблонОповещения,
	               |	СтатусыСПодтверждением.Статус = &СтатусПодтверждено КАК Подтверждено,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа,
	               |	iga_ОповещенияПоВремени.Заявка.Состояние = &СостояниеЗапланирована
	               |		И НЕ iga_ОповещенияПоВремени.Заявка.Состояние = &СостояниеПодтверждена КАК ОтправитьОповещение
	               |ИЗ
	               |	РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ПО iga_ОповещенияПоВремени.Заявка = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка
	               |			И iga_ОповещенияПоВремени.ДатаЗаписи = iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи
	               |			И (ВЫБОР
	               |				КОГДА iga_ОповещенияПоВремени.ТребуетсяПодтверждение
	               |					ТОГДА iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПусто
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК СтатусыСПодтверждением
	               |		ПО iga_ОповещенияПоВремени.Заявка = СтатусыСПодтверждением.Заявка
	               |			И iga_ОповещенияПоВремени.ДатаЗаписи = СтатусыСПодтверждением.ДатаЗаписи
	               |ГДЕ
	               |	НЕ iga_ОповещенияПоВремени.Выполнено
	               |	И iga_ОповещенияПоВремени.ДатаОповещения <= &ТекущаяДата
	               |	И ВЫБОР
	               |			КОГДА iga_ОповещенияПоВремени.ТребуетсяПодтверждение
	               |				ТОГДА iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПусто
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И iga_ОповещенияПоВремени.Заявка.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОповещения";
	Запрос.УстановитьПараметр("СостояниеЗапланирована", Справочники.ВидыСостоянийЗаявок.Запланирована);
	
	СостояниеПодтверждена = Справочники.ВидыСостоянийЗаявок.НайтиПоНаименованию("Подтверждена");
	
	Запрос.УстановитьПараметр("СостояниеПодтверждена", СостояниеПодтверждена);
	Запрос.УстановитьПараметр("СтатусПусто", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусПодтверждено", Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
	ВыполненныеОпвещенияЧатов = Новый Соответствие;
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		Если Не ВыполненныеОпвещенияЧатов.Получить(ВыборкаЗаписей.Чат) = Неопределено Или Не ВыборкаЗаписей.ОтправитьОповещение Тогда
			Запись = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗаписей);
			Запись.Выполнено = Истина;
			Запись.Записать();
			Продолжить;
		Иначе
			iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ВыборкаЗаписей.Чат, "ОтправленоОповещение", Истина);
		КонецЕсли;
		
		ВыполненныеОпвещенияЧатов.Вставить(ВыборкаЗаписей.Чат, Истина);
		
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("Заявка", ВыборкаЗаписей.Заявка);
		ВходящиеПараметры.Вставить("ДатаЗаписи", ВыборкаЗаписей.ДатаЗаписи);
		
		ДанныеСообщения = Неопределено;
		
		Если Не ЗначениеЗаполнено(ВыборкаЗаписей.ШаблонОповещения) Тогда
			
			Если ВыборкаЗаписей.ТребуетсяПодтверждение Тогда
				ДанныеСообщения = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ВыборкаЗаписей.Чат, ВыборкаЗаписей.ЧатИдентификатор, 
					Перечисления.iga_ВидыПредопределенныхШаблонов.ПодтверждениеЗаписи, ВходящиеПараметры);
			Иначе
					
				ДанныеСообщения = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ВыборкаЗаписей.Чат, ВыборкаЗаписей.ЧатИдентификатор, 
					Перечисления.iga_ВидыПредопределенныхШаблонов.ОповещениеОЗаписи, ВходящиеПараметры);
			КонецЕсли; 
		Иначе                       
			Если ВыборкаЗаписей.ТребуетсяПодтверждение Тогда
				ДанныеСообщения = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ВыборкаЗаписей.Чат, ВыборкаЗаписей.ЧатИдентификатор, 
					ВыборкаЗаписей.ШаблонОповещения, ВходящиеПараметры);
			Иначе
				ДанныеСообщения = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ВыборкаЗаписей.Чат, ВыборкаЗаписей.ЧатИдентификатор, 
					ВыборкаЗаписей.ШаблонОповещения, ВходящиеПараметры);
			КонецЕсли;
		КонецЕсли;

		Запись = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗаписей);
		Запись.Выполнено = Истина;
		Запись.Записать();
		
		Если Не ДанныеСообщения = Неопределено Тогда 
			iga_МетодыРаботыСБотом.УстановитьПараметрСообщения(ВыборкаЗаписей.Чат, 
				ДанныеСообщения.IDСообщения, "ДатаЗаписи", ВыборкаЗаписей.ДатаЗаписи);
				
			iga_МетодыРаботыСБотом.УстановитьПараметрСообщения(ВыборкаЗаписей.Чат, 
				ДанныеСообщения.IDСообщения, "Заявка", ВыборкаЗаписей.Заявка);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СтатусПусто", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи КАК ДатаЗаписи,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Статус КАК Статус,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Обработано КАК Обработано
	               |ИЗ
	               |	РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	               |		ПО iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи = iga_ОповещенияПоВремени.ДатаЗаписи
	               |			И iga_СтатусыПодтвержденияСтрокЗаявок.Заявка = iga_ОповещенияПоВремени.Заявка
	               |			И (iga_ОповещенияПоВремени.Выполнено)
	               |			И (iga_ОповещенияПоВремени.ТребуетсяПодтверждение)
	               |ГДЕ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи >= &ТекущаяДата
	               |	И iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПусто
	               |	И РАЗНОСТЬДАТ(iga_ОповещенияПоВремени.ДатаОповещения, &ТекущаяДата, ЧАС) >= 2
	               |	И ЧАС(&ТекущаяДата) >= 7
	               |	И ЧАС(&ТекущаяДата) <= 20";
	ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗаписей);
		Запись.Статус = Перечисления.iga_СтатусыПодтвержденияЗаявок.Просрочено;
		Запись.Записать();
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	iga_ОповещенияПоВремени.ДатаОповещения КАК ДатаОповещения,
	//               |	iga_ОповещенияПоВремени.Заявка КАК Заявка
	//               |ИЗ
	//               |	РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	//               |ГДЕ
	//               |	iga_ОповещенияПоВремени.ДатаЗаписи < &ТекущаяДата
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи КАК ДатаЗаписи,
	//               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
	//               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа
	//               |ИЗ
	//               |	РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	//               |ГДЕ
	//               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи < &ТекущаяДата";
	//Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//ПакетРезультатов = Запрос.ВыполнитьПакет();
	//ВыборкаОповещений = ПакетРезультатов.Получить(0).Выбрать();
	//ВыборкаПодтверждений = ПакетРезультатов.Получить(1).Выбрать();
	//Пока ВыборкаОповещений.Следующий() Цикл
	//	Запись = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
	//	Запись.ДатаОповещения = ВыборкаОповещений.ДатаОповещения;
	//	Запись.Заявка = ВыборкаОповещений.Заявка;
	//	Запись.Удалить();
	//КонецЦикла;
	//
	//Пока ВыборкаПодтверждений.Следующий() Цикл
	//	Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
	//	Запись.ДатаЗаписи = ВыборкаПодтверждений.ДатаЗаписи;
	//	Запись.Заявка = ВыборкаПодтверждений.Заявка;
	//	Запись.Работа = ВыборкаПодтверждений.Работа;
	//	Запись.Удалить();
	//КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура iga_ПроверкаОператоровНаОнлайн() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_НастройкиОператоров.Оператор КАК Оператор,
	               |	iga_НастройкиОператоров.Оператор.Код КАК ОператорКод
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |ГДЕ
	               |	iga_НастройкиОператоров.Статус = &СтатусОнлайн";
	Запрос.УстановитьПараметр("СтатусОнлайн", Перечисления.iga_СтатусыОператоров.Онлайн);
	Выборка = Запрос.Выполнить().Выбрать();
	АктивныеСоединения = ПолучитьСеансыИнформационнойБазы();
	Пока Выборка.Следующий() Цикл
		
			
		ПользовательВСети = Ложь;
		
		Для Каждого Соединение Из АктивныеСоединения Цикл
			Если Соединение.Пользователь.Имя = Выборка.ОператорКод Тогда
				ПользовательВСети = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПользовательВСети Тогда 
			Продолжить; 
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Событие", "_$Session$_.Finish");
		Отбор.Вставить("Пользователь", Выборка.ОператорКод);
		
		ТаблицаЖурнала = Новый ТаблицаЗначений;
		ВыгрузитьЖурналРегистрации(ТаблицаЖурнала, Отбор, "Дата", , 1); 
		
		Если ТаблицаЖурнала.Количество() > 0 Тогда
			ДатаЗавершения = ТаблицаЖурнала[0].Дата;
			
			ТекущийМомент = ТекущаяДатаСеанса();
			РазницаВСекундах = ТекущийМомент - ДатаЗавершения;
			
			Если РазницаВСекундах > 300 Тогда
				
				
				ЗаписьНастроекОператора = РегистрыСведений.iga_НастройкиОператоров.СоздатьМенеджерЗаписи();
				ЗаписьНастроекОператора.Оператор = Выборка.Оператор;
				ЗаписьНастроекОператора.Прочитать();
				Если ЗаписьНастроекОператора.Выбран() Тогда
					ЗаписьНастроекОператора.Статус = Перечисления.iga_СтатусыОператоров.Оффлайн;
					ЗаписьНастроекОператора.ПриниматьНовыеЧаты = Ложь;
					ЗаписьНастроекОператора.Записать();
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			ЗаписьНастроекОператора = РегистрыСведений.iga_НастройкиОператоров.СоздатьМенеджерЗаписи();
			ЗаписьНастроекОператора.Оператор = Выборка.Оператор;
			ЗаписьНастроекОператора.Прочитать();
			Если ЗаписьНастроекОператора.Выбран() Тогда
				ЗаписьНастроекОператора.Статус = Перечисления.iga_СтатусыОператоров.Оффлайн;
				ЗаписьНастроекОператора.ПриниматьНовыеЧаты = Ложь;
				ЗаписьНастроекОператора.Записать();
			КонецЕсли;
			
		КонецЕсли;
		

		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура iga_ОбработкаПакетныхОповещений() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПлановыеОповещенияПользователей.Заявка КАК Заявка,
	               |	iga_ПлановыеОповещенияПользователей.ДатаОповещения КАК ДатаОповещения,
	               |	iga_ПлановыеОповещенияПользователей.ШаблонОповещения КАК ШаблонОповещения,
	               |	iga_ПлановыеОповещенияПользователей.АлгоритмОповещения КАК АлгоритмОповещения,
	               |	iga_ПлановыеОповещенияПользователей.Чат КАК Чат,
	               |	iga_ПлановыеОповещенияПользователей.Чат.Идентификатор КАК ИдЧата,
	               |	iga_ПлановыеОповещенияПользователей.АлгоритмПередОповещением КАК АлгоритмПередОповещением,
	               |	iga_ПлановыеОповещенияПользователей.Пакет КАК Пакет
	               |ИЗ
	               |	РегистрСведений.iga_ПлановыеОповещенияПользователей КАК iga_ПлановыеОповещенияПользователей
	               |ГДЕ
	               |	iga_ПлановыеОповещенияПользователей.Заявка.Проведен
	               |	И iga_ПлановыеОповещенияПользователей.ДатаОповещения <= &ТекущаяДата
	               |	И НЕ iga_ПлановыеОповещенияПользователей.Отправлено
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОповещения";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	ВыборкаОповещений = Запрос.Выполнить().Выбрать();
	
	ОбработчикАлгоритмов = Обработки.iga_ОбработчикЭтапов.Создать();
	
	ОбработчикАлгоритмов.ВходящиеПараметры = Новый Структура;

	Пока ВыборкаОповещений.Следующий() Цикл
		
		iga_НапоминанияВызовСервера.ВыполнитьОповещениеПакета(ВыборкаОповещений, ОбработчикАлгоритмов);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура iga_ОбработкаНастраиваемыхАлгоритмов() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_АлгоритмыВРасписании.АлгоритмПроверки КАК АлгоритмПроверки,
	               |	iga_АлгоритмыВРасписании.АлгоритмВыполнения КАК АлгоритмВыполнения
	               |ИЗ
	               |	РегистрСведений.iga_АлгоритмыВРасписании КАК iga_АлгоритмыВРасписании
	               |ГДЕ
	               |	iga_АлгоритмыВРасписании.Активно
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	iga_АлгоритмыВРасписании.Порядок";
	ВыборкаАлгоритмов = Запрос.Выполнить().Выбрать();
	ОбработчикАлгоритмов = Обработки.iga_ОбработчикЭтапов.Создать();
	Пока ВыборкаАлгоритмов.Следующий() Цикл
		ОбработчикАлгоритмов.ВходящиеПараметры = Новый Структура;
		
		РезультатПроверки = ОбработчикАлгоритмов.ВыполнитьАлгоритмВИсключении(ВыборкаАлгоритмов.АлгоритмПроверки);
		Если Не РезультатПроверки = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработчикАлгоритмов.ВыполнитьАлгоритмВИсключении(ВыборкаАлгоритмов.АлгоритмВыполнения);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура iga_ОчисткаОтправленныхОповещений() Экспорт
	
	Если Не СоответствиеХешаПройдено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПлановыеОповещенияПользователей.Заявка КАК Заявка,
	               |	iga_ПлановыеОповещенияПользователей.ДатаОповещения КАК ДатаОповещения
	               |ИЗ
	               |	РегистрСведений.iga_ПлановыеОповещенияПользователей КАК iga_ПлановыеОповещенияПользователей
	               |ГДЕ
	               |	iga_ПлановыеОповещенияПользователей.ДатаОповещения < &ТекущаяДата
	               |	И iga_ПлановыеОповещенияПользователей.Отправлено
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОповещения";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	ВыборкаОповещений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаОповещений.Следующий() Цикл
		Запись = РегистрыСведений.iga_ЗаписиКОповещению.СоздатьМенеджерЗаписи();
		Запись.Заявка = ВыборкаОповещений.Заявка;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда 
			Запись.Удалить();
		КонецЕсли;
		
		Запись = РегистрыСведений.iga_ЗаявкиКОповещениюПоПредоплате.СоздатьМенеджерЗаписи();
		Запись.Заявка = ВыборкаОповещений.Заявка;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда 
			Запись.Удалить();
		КонецЕсли;
		
		Запись = РегистрыСведений.iga_ПлановыеОповещенияПользователей.СоздатьМенеджерЗаписи();
		Запись.Заявка = ВыборкаОповещений.Заявка;
		Запись.ДатаОповещения = ВыборкаОповещений.ДатаОповещения;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда 
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
